Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.ModelCreationTypeEnum Enumeration
 Defines the model creation type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ModelCreationTypeEnum
Public Enumeration ModelCreationTypeEnum
Members
Member name | Value | Description
FULL_MODEL | 0 |  Creates an analysis model using the full model.
BY_WORK_AREA | 1 |  Creates an analysis model using the selected area.
BY_SELECTED_PARTS | 2 |  Creates an analysis model using the selected parts.
BY_SELECTED_PARTS_AND_LOADS | 3 |  Creates an analysis model using the selected parts and loads.
FLOOR_MODEL_BY_SELECTED_PARTS_AND_LOADS | 4 |  Creates a floor model using the selected parts and loads.
See Also
Reference
Tekla.Structures.Analysis Namespace